apache/nuttx/arch/arm/src/kinetis/kinetis_usbhshost.c
  __TRACE1_NSTRINGS,                /* Separates the format 1 from the format 2 strings */

  EHCI_TRACE2_EPSTALLED,            /* EHCI EP Stalled */
  EHCI_TRACE2_EPIOERROR,            /* EHCI ERROR: EP TOKEN */
  EHCI_TRACE2_CLASSENUM_FAILED,     /* EHCI usbhost_enumerate() failed */

#ifdef HAVE_USBHOST_TRACE_VERBOSE
  EHCI_VTRACE2_ASYNCXFR,            /* EHCI Async transfer */
  EHCI_VTRACE2_INTRXFR,             /* EHCI Interrupt Transfer */
  EHCI_VTRACE2_IOCCHECK,            /* EHCI IOC */
  EHCI_VTRACE2_PORTSC,              /* EHCI PORTSC */
  EHCI_VTRACE2_PORTSC_CONNECTED,    /* EHCI RHPort connected */
  EHCI_VTRACE2_PORTSC_DISCONND,     /* EHCI RHport disconnected */
  EHCI_VTRACE2_MONWAKEUP,           /* EHCI RHPort connected wakeup */

  EHCI_VTRACE2_EPALLOC,             /* EHCI EPALLOC */
  EHCI_VTRACE2_CTRLINOUT,           /* EHCI CTRLIN/OUT */
  EHCI_VTRACE2_HCIVERSION,          /* EHCI HCIVERSION */
  EHCI_VTRACE2_HCSPARAMS,           /* EHCI HCSPARAMS */
#endif

  __TRACE2_NSTRINGS                 /* Total number of enumeration values */
};

/* USB trace data structure */

struct kinetis_ehci_trace_s
{
#if 0
  uint16_t id;
  bool fmt2;
#endif
  const char *string;
};

#endif /* HAVE_USBHOST_TRACE */

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

static uint16_t kinetis_read16(const uint8_t *addr);
static uint32_t kinetis_read32(const uint8_t *addr);
#if 0 /* Not used */
static void kinetis_write16(uint16_t memval, uint8_t *addr);
static void kinetis_write32(uint32_t memval, uint8_t *addr);
#endif

#ifdef CONFIG_ENDIAN_BIG
static uint16_t kinetis_swap16(uint16_t value);
static uint32_t kinetis_swap32(uint32_t value);
#else
#  define kinetis_swap16(value) (value)
#  define kinetis_swap32(value) (value)
#endif

#ifdef CONFIG_KINETIS_EHCI_REGDEBUG
static void kinetis_printreg(volatile uint32_t *regaddr, uint32_t regval,
         bool iswrite);
static void kinetis_checkreg(volatile uint32_t *regaddr, uint32_t regval,
         bool iswrite);
static uint32_t kinetis_getreg(volatile uint32_t *regaddr);
static void kinetis_putreg(uint32_t regval, volatile uint32_t *regaddr);
#else
static inline uint32_t kinetis_getreg(volatile uint32_t *regaddr);
static inline void kinetis_putreg(uint32_t regval,
                                  volatile uint32_t *regaddr);
#endif
static int ehci_wait_usbsts(uint32_t maskbits, uint32_t donebits,
         unsigned int delay);

/* Allocators ***************************************************************/

static struct kinetis_qh_s *kinetis_qh_alloc(void);
static void kinetis_qh_free(struct kinetis_qh_s *qh);
static struct kinetis_qtd_s *kinetis_qtd_alloc(void);
static void kinetis_qtd_free(struct kinetis_qtd_s *qtd);

/* List Management **********************************************************/

static int kinetis_qh_foreach(struct kinetis_qh_s *qh, uint32_t **bp,
         foreach_qh_t handler, void *arg);
static int kinetis_qtd_foreach(struct kinetis_qh_s *qh,
         foreach_qtd_t handler,
         void *arg);
static int kinetis_qtd_discard(struct kinetis_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int kinetis_qh_discard(struct kinetis_qh_s *qh);

/* Cache Operations *********************************************************/

#if 0 /* Not used */
static int kinetis_qtd_invalidate(struct kinetis_qtd_s *qtd, uint32_t **bp,
          void *arg);
static int kinetis_qh_invalidate(struct kinetis_qh_s *qh);
#endif
static int kinetis_qtd_flush(struct kinetis_qtd_s *qtd, uint32_t **bp,
                           void *arg);
static int kinetis_qh_flush(struct kinetis_qh_s *qh);

/* Endpoint Transfer Handling ***********************************************/

#ifdef CONFIG_KINETIS_EHCI_REGDEBUG
static void kinetis_qtd_print(struct kinetis_qtd_s *qtd);
static void kinetis_qh_print(struct kinetis_qh_s *qh);
static int kinetis_qtd_dump(struct kinetis_qtd_s *qtd,
                            uint32_t **bp, void *arg);
static int kinetis_qh_dump(struct kinetis_qh_s *qh,
                           uint32_t **bp, void *arg);
#else
#  define kinetis_qtd_print(qtd)
#  define kinetis_qh_print(qh)
#  define kinetis_qtd_dump(qtd, bp, arg) OK
#  define kinetis_qh_dump(qh, bp, arg)   OK
#endif

static inline uint8_t kinetis_ehci_speed(uint8_t usbspeed);
static int kinetis_ioc_setup(struct kinetis_rhport_s *rhport,
         struct kinetis_epinfo_s *epinfo);
static int kinetis_ioc_wait(struct kinetis_epinfo_s *epinfo);
static void kinetis_qh_enqueue(struct kinetis_qh_s *qhead,
         struct kinetis_qh_s *qh);
static struct
kinetis_qh_s *kinetis_qh_create(struct kinetis_rhport_s *rhport,
         struct kinetis_epinfo_s *epinfo);
static int kinetis_qtd_addbpl(struct kinetis_qtd_s *qtd, const void *buffer,
         size_t buflen);
static struct kinetis_qtd_s *kinetis_qtd_setupphase(
         struct kinetis_epinfo_s *epinfo, const struct usb_ctrlreq_s *req);
static struct
kinetis_qtd_s *kinetis_qtd_dataphase(struct kinetis_epinfo_s *epinfo,
         void *buffer, int buflen, uint32_t tokenbits);
static struct kinetis_qtd_s *kinetis_qtd_statusphase(uint32_t tokenbits);
static ssize_t kinetiskinetis_virtramaddr_async_setup(
         struct kinetis_rhport_s *rhport, struct kinetis_epinfo_s *epinfo,
         const struct usb_ctrlreq_s *req, uint8_t *buffer, size_t buflen);
#ifndef CONFIG_USBHOST_INT_DISABLE
static int kinetis_intr_setup(struct kinetis_rhport_s *rhport,
         struct kinetis_epinfo_s *epinfo, uint8_t *buffer, size_t buflen);
#endif
static ssize_t kinetis_transfer_wait(struct kinetis_epinfo_s *epinfo);
#ifdef CONFIG_USBHOST_ASYNCH
static inline int kinetis_ioc_async_setup(struct kinetis_rhport_s *rhport,
         struct kinetis_epinfo_s *epinfo, usbhost_asynch_t callback,
         void *arg);
static void kinetis_asynch_completion(struct kinetis_epinfo_s *epinfo);
#endif

/* Interrupt Handling *******************************************************/

static int kinetis_qtd_ioccheck(struct kinetis_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int kinetis_qh_ioccheck(struct kinetis_qh_s *qh, uint32_t **bp,
         void *arg);
#ifdef CONFIG_USBHOST_ASYNCH
static int kinetis_qtd_cancel(struct kinetis_qtd_s *qtd, uint32_t **bp,
         void *arg);
static int kinetis_qh_cancel(struct kinetis_qh_s *qh,
                             uint32_t **bp, void *arg);
#endif
static inline void kinetis_ioc_bottomhalf(void);
static inline void kinetis_portsc_bottomhalf(void);
static inline void kinetis_syserr_bottomhalf(void);
static inline void kinetis_async_advance_bottomhalf(void);
static void kinetis_ehci_bottomhalf(void *arg);
static int kinetis_ehci_interrupt(int irq,
                                  void *context, void *arg);

/* USB Host Controller Operations *******************************************/

static int kinetis_wait(struct usbhost_connection_s *conn,
                        struct usbhost_hubport_s **hport);
static int kinetis_rh_enumerate(struct usbhost_connection_s *conn,
                                struct usbhost_hubport_s *hport);
static int kinetis_enumerate(struct usbhost_connection_s *conn,
                             struct usbhost_hubport_s *hport);
static int kinetis_ep0configure(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep0, uint8_t funcaddr,
                                uint8_t speed, uint16_t maxpacketsize);
static int kinetis_epalloc(struct usbhost_driver_s *drvr,
                           const struct usbhost_epdesc_s *epdesc,
                           usbhost_ep_t *ep);
static int kinetis_epfree(struct usbhost_driver_s *drvr,
                          usbhost_ep_t ep);
static int kinetis_alloc(struct usbhost_driver_s *drvr,
                         uint8_t **buffer, size_t *maxlen);
static int kinetis_free(struct usbhost_driver_s *drvr,
                        uint8_t *buffer);
static int kinetis_ioalloc(struct usbhost_driver_s *drvr,
                           uint8_t **buffer, size_t buflen);
static int kinetis_iofree(struct usbhost_driver_s *drvr,
                          uint8_t *buffer);
static int kinetis_ctrlin(struct usbhost_driver_s *drvr,
                          usbhost_ep_t ep0,
                          const struct usb_ctrlreq_s *req,
                          uint8_t *buffer);
static int kinetis_ctrlout(struct usbhost_driver_s *drvr,
                           usbhost_ep_t ep0,
                           const struct usb_ctrlreq_s *req,
                           const uint8_t *buffer);
static ssize_t kinetis_transfer(struct usbhost_driver_s *drvr,
                                usbhost_ep_t ep, uint8_t *buffer,
                                size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static int kinetis_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                          uint8_t *buffer, size_t buflen,
                          usbhost_asynch_t callback, void *arg);
#endif
static int kinetis_cancel(struct usbhost_driver_s *drvr,
                          usbhost_ep_t ep);
#ifdef CONFIG_USBHOST_HUB
static int kinetis_connect(struct usbhost_driver_s *drvr,
                           struct usbhost_hubport_s *hport,
                           bool connected);
#endif
static void kinetis_disconnect(struct usbhost_driver_s *drvr,
                               struct usbhost_hubport_s *hport);

/* Initialization ***********************************************************/

static int kinetis_reset(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* In this driver implementation, support is provided for only a single
 * USB device.  All status information can be simply retained in a
 * single global instance.
 */

static struct kinetis_ehci_s g_ehci =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
  .ep0.iocsem = SEM_INITIALIZER(1),
};

/* This is the connection/enumeration interface */

static struct usbhost_connection_s g_ehciconn =
{
  .wait = kinetis_wait,
  .enumerate = kinetis_enumerate,
};

