apache/nuttx/arch/arm/src/kinetis/kinetis_usbhshost.c
#ifdef CONFIG_KINETIS_EHCI_REGDEBUG
static void kinetis_printreg(volatile uint32_t *regaddr, uint32_t regval,
                           bool iswrite)
{
  uinfo("%08x%s%08x\n", (uintptr_t)regaddr, iswrite ? "<-" : "->", regval);
}
#endif

/****************************************************************************
 * Name: kinetis_checkreg
 *
 * Description:
 *   Check if it is time to output debug information for accesses to a
 *   KINETIS EHCI register
 *
 ****************************************************************************/

#ifdef CONFIG_KINETIS_EHCI_REGDEBUG
static void kinetis_checkreg(volatile uint32_t *regaddr, uint32_t regval,
                           bool iswrite)
{
  static uint32_t *prevaddr = NULL;
  static uint32_t preval = 0;
  static uint32_t count = 0;
  static bool     prevwrite = false;

  /* Is this the same value that we read from/wrote to the same register last
   * time?  Are we polling the register?  If so, suppress the output.
   */

  if (regaddr == prevaddr && regval == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

      count++;
    }
  else
    {
      /* No this is a new address or value or operation. Were there any
       * duplicate accesses before this one?
       */

      if (count > 0)
        {
          /* Yes.. Just one? */

          if (count == 1)
            {
              /* Yes.. Just one */

              kinetis_printreg(prevaddr, preval, prevwrite);
            }
          else
            {
              /* No.. More than one. */

              uinfo("[repeats %d more times]\n", count);
            }
        }

      /* Save the new address, value, count, and operation for next time */

      prevaddr  = (uint32_t *)regaddr;
      preval    = regval;
      count     = 0;
      prevwrite = iswrite;

      /* Show the new register access */

      kinetis_printreg(regaddr, regval, iswrite);
    }
}
#endif

/****************************************************************************
 * Name: kinetis_getreg
 *
 * Description:
 *   Get the contents of an KINETIS register
 *
 ****************************************************************************/

#ifdef CONFIG_KINETIS_EHCI_REGDEBUG
static uint32_t kinetis_getreg(volatile uint32_t *regaddr)
{
  /* Read the value from the register */

  uint32_t regval = *regaddr;

  /* Check if we need to print this value */

  kinetis_checkreg(regaddr, regval, false);
  return regval;
}
#else
static inline uint32_t kinetis_getreg(volatile uint32_t *regaddr)
{
  return *regaddr;
}
#endif

/****************************************************************************
 * Name: kinetis_putreg
 *
 * Description:
 *   Set the contents of an KINETIS register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_KINETIS_EHCI_REGDEBUG
static void kinetis_putreg(uint32_t regval, volatile uint32_t *regaddr)
{
  /* Check if we need to print this value */

  kinetis_checkreg(regaddr, regval, true);

  /* Write the value */

  *regaddr = regval;
}
#else
static inline void kinetis_putreg(uint32_t regval,
                                  volatile uint32_t *regaddr)
{
  *regaddr = regval;
}
#endif

/****************************************************************************
 * Name: ehci_wait_usbsts
 *
 * Description:
 *   Wait for either (1) a field in the USBSTS register to take a specific
 *   value, (2) for a timeout to occur, or (3) a error to occur.  Return
 *   a value to indicate which terminated the wait.
 *
 ****************************************************************************/

static int ehci_wait_usbsts(uint32_t maskbits, uint32_t donebits,
                            unsigned int delay)
{
  uint32_t regval;
  unsigned int timeout;

  timeout = 0;
  do
    {
      /* Wait 5usec before trying again */

      up_udelay(5);
      timeout += 5;

      /* Read the USBSTS register and check for a system error */

      regval = kinetis_getreg(&HCOR->usbsts);
      if ((regval & EHCI_INT_SYSERROR) != 0)
        {
          usbhost_trace1(EHCI_TRACE1_SYSTEMERROR, regval);
          return -EIO;
        }

      /* Mask out the bits of interest */

      regval &= maskbits;

      /* Loop until the masked bits take the specified value or until a
       * timeout occurs.
       */
    }
  while (regval != donebits && timeout < delay);

  /* We got here because either the waited for condition or a timeout
   * occurred.  Return a value to indicate which.
   */

  return (regval == donebits) ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: kinetis_qh_alloc
 *
 * Description:
 *   Allocate a Queue Head (QH) structure by removing it from the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static struct kinetis_qh_s *kinetis_qh_alloc(void)
{
  struct kinetis_qh_s *qh;

  /* Remove the QH structure from the freelist */

  qh = g_ehci.qhfree;
  if (qh)
    {
      g_ehci.qhfree = qh->flink;
      memset(qh, 0, sizeof(struct kinetis_qh_s));
    }

  return qh;
}

/****************************************************************************
 * Name: kinetis_qh_aawait
 *
 * Description:
 *   Let a Queue Head (QH) structure wait for free by adding it to the
 *   aawait list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static void kinetis_qh_aawait(struct kinetis_qh_s *qh)
{
  uint32_t regval;

  /* Put the QH structure to the aawait list */

  qh->flink  = g_ehci.qhaawait;
  g_ehci.qhaawait = qh;

  regval = kinetis_getreg(&HCOR->usbcmd);
  kinetis_putreg(regval | EHCI_USBCMD_IAADB, &HCOR->usbcmd);
}

/****************************************************************************
 * Name: kinetis_qh_free
 *
 * Description:
 *   Free a Queue Head (QH) structure by returning it to the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

static void kinetis_qh_free(struct kinetis_qh_s *qh)
{
  /* Put the QH structure back into the free list */

  qh->flink  = g_ehci.qhfree;
  g_ehci.qhfree = qh;
}

/****************************************************************************
 * Name: kinetis_qtd_alloc
 *
 * Description:
 *   Allocate a Queue Element Transfer Descriptor (qTD) by removing it from
 *   the free list
 *
 * Assumption:  Caller holds the lock
 *
 ****************************************************************************/

