apache/nuttx/arch/arm/src/kinetis/kinetis_usbhshost.c
      kinetis_qh_free(&g_qhpool[i]);
    }

#  ifndef CONFIG_KINETIS_EHCI_PREALLOCATE
  /* Allocate a pool of free Transfer Descriptor (qTD) structures */

  g_qtdpool = kmm_memalign(32, CONFIG_KINETIS_EHCI_NQTDS *
                               sizeof(struct kinetis_qtd_s));
  if (!g_qtdpool)
    {
      usbhost_trace1(EHCI_TRACE1_QTDPOOLALLOC_FAILED, 0);
      kmm_free(g_qhpool);
      return NULL;
    }
#  endif

#  if !defined(CONFIG_KINETIS_EHCI_PREALLOCATE) && !defined(CONFIG_USBHOST_INT_DISABLE)
  /* Allocate the periodic framelist */

  g_framelist = kmm_memalign(4096, FRAME_LIST_SIZE * sizeof(uint32_t));
  if (!g_framelist)
    {
      usbhost_trace1(EHCI_TRACE1_PERFLALLOC_FAILED, 0);
      kmm_free(g_qhpool);
      kmm_free(g_qtdpool);
      return NULL;
    }
#  endif

  /* Initialize the list of free Transfer Descriptor (qTD) structures */

  for (i = 0; i < CONFIG_KINETIS_EHCI_NQTDS; i++)
    {
      /* Put the TD in a free list */

      kinetis_qtd_free(&g_qtdpool[i]);
    }

  /* Reset the controller from the OTG peripheral */

  putreg32(USBHS_USBCMD_RST, KINETIS_USBHS_USBCMD);
  while ((getreg32(KINETIS_USBHS_USBCMD) & USBHS_USBCMD_RST) != 0);

  /* Program the controller to be the USB host controller Fixed selections:
   * CM = Host mode ES = 0, Little endian mode.  SLOM Not used in host mode.
   * VBPS = 1, off-chip power source Configurable selections: SDIS = 1,
   * Stream disable mode.  Eliminates overruns/underruns at the expense of
   * some performance.
   */

#  ifdef CONFIG_KINETIS_EHCI_SDIS
  putreg32(USBHS_USBMODE_CM_HOST | USBHS_USBMODE_SDIS,
      KINETIS_USBHS_MODE);
#  else
  putreg32(USBHS_USBMODE_CM_HOST,
      KINETIS_USBHS_MODE);
#  endif

  /* Reset the EHCI hardware */

  ret = kinetis_reset();
  if (ret < 0)
    {
      usbhost_trace1(EHCI_TRACE1_RESET_FAILED, -ret);
      return NULL;
    }

  /* Re-program the USB host controller.  As implemented, kinetis_reset()
   * requires the host mode setup in order to work.  However, we lose the
   * host configuration in the reset.
   */

#  ifdef CONFIG_KINETIS_EHCI_SDIS
  putreg32(USBHS_USBMODE_CM_HOST | USBHS_USBMODE_SDIS,
      KINETIS_USBHS_MODE);
#  else
  putreg32(USBHS_USBMODE_CM_HOST,
      KINETIS_USBHS_MODE);
#  endif

  /* Disable all interrupts */

  kinetis_putreg(0, &HCOR->usbintr);

  /* Clear pending interrupts.  Bits in the USBSTS register are cleared by
   * writing a '1' to the corresponding bit.
   */

  kinetis_putreg(EHCI_INT_ALLINTS, &HCOR->usbsts);

#  if defined(CONFIG_DEBUG_USB) && defined(CONFIG_DEBUG_INFO)
  /* Show the EHCI version */

  regval16 = kinetis_swap16(HCCR->hciversion);
  usbhost_vtrace2(EHCI_VTRACE2_HCIVERSION, regval16 >> 8, regval16 & 0xff);

  /* Verify that the correct number of ports is reported */

  regval = kinetis_getreg(&HCCR->hcsparams);
  nports = (regval & EHCI_HCSPARAMS_NPORTS_MASK) >>
            EHCI_HCSPARAMS_NPORTS_SHIFT;

  usbhost_vtrace2(EHCI_VTRACE2_HCSPARAMS, nports, regval);
  DEBUGASSERT(nports == KINETIS_EHCI_NRHPORT);

  /* Show the HCCPARAMS register */

  regval = kinetis_getreg(&HCCR->hccparams);
  usbhost_vtrace1(EHCI_VTRACE1_HCCPARAMS, regval);
#  endif

  /* Initialize the head of the asynchronous queue/reclamation list. "In
   * order to communicate with devices via the asynchronous schedule, system
   * software must write the ASYNDLISTADDR register with the address of a
   * control or bulk queue head. Software must then enable the asynchronous
   * schedule by writing a one to the Asynchronous Schedule Enable bit in
   * the USBCMD register. In order to communicate with devices via the
   * periodic schedule, system software must enable the periodic schedule by
   * writing a one to the Periodic Schedule Enable bit in the USBCMD
   * register. Note that the schedules can be turned on before the first
   * port is reset (and enabled)."
   */

  memset(&g_asynchead, 0, sizeof(struct kinetis_qh_s));
  physaddr = kinetis_physramaddr((uintptr_t)&g_asynchead);
  g_asynchead.hw.hlp = kinetis_swap32(physaddr | QH_HLP_TYP_QH);
  g_asynchead.hw.epchar = kinetis_swap32(QH_EPCHAR_H | QH_EPCHAR_EPS_FULL);
  g_asynchead.hw.overlay.nqp = kinetis_swap32(QH_NQP_T);
  g_asynchead.hw.overlay.alt = kinetis_swap32(QH_NQP_T);
  g_asynchead.hw.overlay.token = kinetis_swap32(QH_TOKEN_HALTED);
  g_asynchead.fqp = kinetis_swap32(QTD_NQP_T);

  /* Set the Current Asynchronous List Address. */

  up_flush_dcache((uintptr_t)&g_asynchead.hw,
    (uintptr_t)&g_asynchead.hw + sizeof(struct ehci_qh_s));

  kinetis_putreg(kinetis_swap32(physaddr), &HCOR->asynclistaddr);

#  ifndef CONFIG_USBHOST_INT_DISABLE

  /* Initialize the head of the periodic list.  Since Isochronous endpoints
   * are not not yet supported, each element of the frame list is initialized
   * to point to the Interrupt Queue Head (g_intrhead).
   */

  memset(&g_intrhead, 0, sizeof(struct kinetis_qh_s));
  g_intrhead.hw.hlp = kinetis_swap32(QH_HLP_T);
  g_intrhead.hw.overlay.nqp = kinetis_swap32(QH_NQP_T);
  g_intrhead.hw.overlay.alt = kinetis_swap32(QH_NQP_T);
  g_intrhead.hw.overlay.token = kinetis_swap32(QH_TOKEN_HALTED);
  g_intrhead.hw.epcaps = kinetis_swap32(QH_EPCAPS_SSMASK(1));

  /* Attach the periodic QH to Period Frame List */

  physaddr = kinetis_physramaddr((uintptr_t)&g_intrhead);
  for (i = 0; i < FRAME_LIST_SIZE; i++)
    {
      g_framelist[i] = kinetis_swap32(physaddr) | PFL_TYP_QH;
    }

  /* Set the Periodic Frame List Base Address. */

  physaddr = kinetis_physramaddr((uintptr_t) g_framelist);
  kinetis_putreg(kinetis_swap32(physaddr), &HCOR->periodiclistbase);
#  endif

  /* Enable the asynchronous schedule and, possibly enable the periodic
   * schedule and set the frame list size.
   */

  regval = kinetis_getreg(&HCOR->usbcmd);
  regval &= ~(EHCI_USBCMD_HCRESET | EHCI_USBCMD_FLSIZE_MASK |
              EHCI_USBCMD_FLSIZE_MASK | EHCI_USBCMD_PSEN |
              EHCI_USBCMD_IAADB | EHCI_USBCMD_LRESET);
  regval |= EHCI_USBCMD_ASEN;

#  ifndef CONFIG_USBHOST_INT_DISABLE
  regval |= EHCI_USBCMD_PSEN;
#    if FRAME_LIST_SIZE == 1024
  regval |= EHCI_USBCMD_FLSIZE_1024;
#    elif FRAME_LIST_SIZE == 512
  regval |= EHCI_USBCMD_FLSIZE_512;
#    elif FRAME_LIST_SIZE == 256
  regval |= EHCI_USBCMD_FLSIZE_256;
#    else
#      error Unsupported frame size list size
#    endif
#  endif

